#Напишете командна процедура која ќе прима произволен број на влезни аргументи кои означуваат времиња на извршување на програма изразени во минути.
#пример - bash script.sh 5 7 15 8 22 6 
#Потребно е процедурата да пресмета и испечати просечно времетраење на програмата според првите три извршувања (5, 7, 15 во примерот) претставено во секунди, како и бројот на извршувања на програмата (број на направени/внесени мерења).
#Доколку бројот на влезни аргументи е поголем или еднаков на 5, потребно е да се испечати 'The testing is done', додека доколку е помал од 5 - 'More testing is needed'.

#Излезот на примерот треба да биде следниот:
#Average execution time: 540
#Count of executions: 6
#The testing is done

#!/bin/bash

if [ $# -gt 5 ]
then

        sum=`expr $1 + $2 + $3`
        avg=`expr $sum \* 60 / 3`
        echo "Average execution time: ${avg}"
        echo "Count of executions: ${#}"
        echo "The testing is done"
else
        echo "More testing is needed"
fi

